{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "GRU", "config": {"U_regularizer": null, "name": "gru_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 100, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": true, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dtype": "float32", "return_sequences": true, "batch_input_shape": [1, 50, 40], "W_regularizer": null, "activation": "tanh", "b_regularizer": null}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 40}}, "trainable": true, "name": "timedistributed_1"}}]}