{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"output_dim": 100, "input_dtype": "float32", "b_constraint": null, "bias": true, "W_constraint": null, "input_dim": 4, "batch_input_shape": [null, 4], "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_1", "activation": "linear", "trainable": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "name": "leakyrelu_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 100, "W_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "dense_2", "activation": "linear", "trainable": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "name": "leakyrelu_2", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 2, "W_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "dense_3", "activation": "linear", "trainable": true}}], "keras_version": "1.1.1"}