{"config": [{"config": {"name": "dense_1", "activation": "linear", "output_dim": 100, "batch_input_shape": [null, 4], "input_dim": 4, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "trainable": true, "input_dtype": "float32", "bias": true, "b_regularizer": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "leakyrelu_1", "alpha": 0.3, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "activation": "linear", "output_dim": 100, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "leakyrelu_2", "alpha": 0.3, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "activation": "linear", "output_dim": 2, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}