{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "GRU", "config": {"U_regularizer": null, "input_length": null, "name": "gru_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 100, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dtype": "float32", "input_dim": 64, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "batch_input_shape": [null, null, 64]}}, {"class_name": "RepeatVector", "config": {"trainable": true, "name": "repeatvector_1", "n": 2312}}, {"class_name": "GRU", "config": {"U_regularizer": null, "name": "gru_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 100, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 100, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "input_length": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "GRU", "config": {"U_regularizer": null, "name": "gru_3", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 44, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 100, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}}]}