{"class_name": "Model", "keras_version": "1.2.1", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2312, 64], "input_dtype": "float32", "sparse": false, "name": "main_input"}, "inbound_nodes": [], "name": "main_input"}, {"class_name": "PhasedLSTM", "config": {"U_regularizer": null, "name": "phasedlstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "input_dim": 64, "unroll": false, "consume_less": "gpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "return_sequences": false, "alpha": 0.001, "b_regularizer": null, "W_regularizer": null, "output_dim": 1024, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["main_input", 0, 0]]], "name": "phasedlstm_1"}, {"class_name": "RepeatVector", "config": {"trainable": true, "name": "repeatvector_1", "n": 2312}, "inbound_nodes": [[["phasedlstm_1", 0, 0]]], "name": "repeatvector_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2312, 44], "input_dtype": "float32", "sparse": false, "name": "feedback_in"}, "inbound_nodes": [], "name": "feedback_in"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["repeatvector_1", 0, 0], ["feedback_in", 0, 0]]], "name": "merge_1"}, {"class_name": "PhasedLSTM", "config": {"U_regularizer": null, "name": "phasedlstm_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "input_dim": 1068, "unroll": false, "consume_less": "gpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "return_sequences": true, "alpha": 0.001, "b_regularizer": null, "W_regularizer": null, "output_dim": 256, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "phasedlstm_2"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["phasedlstm_2", 0, 0]]], "name": "dropout_1"}, {"class_name": "PhasedLSTM", "config": {"U_regularizer": null, "name": "params_output", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "linear", "trainable": true, "input_dim": 256, "unroll": false, "consume_less": "gpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "return_sequences": true, "alpha": 0.001, "b_regularizer": null, "W_regularizer": null, "output_dim": 42, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "params_output"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 2}}, "trainable": true, "name": "flags_output"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "flags_output"}], "input_layers": [["main_input", 0, 0], ["feedback_in", 0, 0]], "output_layers": [["params_output", 0, 0], ["flags_output", 0, 0]], "name": "model_1"}}