{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 850], "input_dtype": "int32", "sparse": false, "name": "src_spk_in"}, "inbound_nodes": [], "name": "src_spk_in"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 850], "input_dtype": "int32", "sparse": false, "name": "trg_spk_in"}, "inbound_nodes": [], "name": "trg_spk_in"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 850, 44], "input_dtype": "float32", "sparse": false, "name": "main_input"}, "inbound_nodes": [], "name": "main_input"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "spk_index_embedding", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 2, "batch_input_shape": [null, 850], "W_regularizer": null, "dropout": 0.0, "output_dim": 5, "input_length": 850}, "inbound_nodes": [[["src_spk_in", 0, 0]], [["trg_spk_in", 0, 0]]], "name": "spk_index_embedding"}, {"class_name": "Merge", "config": {"name": "inputs_merge", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["main_input", 0, 0], ["spk_index_embedding", 0, 0], ["spk_index_embedding", 1, 0]]], "name": "inputs_merge"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "encoder_LSTM_forwards", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "gpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 54, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 1024, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["inputs_merge", 0, 0]]], "name": "encoder_LSTM_forwards"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "encoder_LSTM_backwards", "inner_activation": "hard_sigmoid", "go_backwards": true, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "gpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 54, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 1024, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["inputs_merge", 0, 0]]], "name": "encoder_LSTM_backwards"}, {"class_name": "Merge", "config": {"name": "encoder_bidirectional_merge", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["encoder_LSTM_forwards", 0, 0], ["encoder_LSTM_backwards", 0, 0]]], "name": "encoder_bidirectional_merge"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 850, 44], "input_dtype": "float32", "sparse": false, "name": "feedback_in"}, "inbound_nodes": [], "name": "feedback_in"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["encoder_bidirectional_merge", 0, 0], ["feedback_in", 0, 0]]], "name": "merge_1"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "decoder_LSTM", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "gpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 1068, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 1024, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "decoder_LSTM"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["decoder_LSTM", 0, 0]]], "name": "dropout_1"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "params_output", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "linear", "trainable": true, "unroll": false, "consume_less": "gpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 1024, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 42, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "params_output"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1024, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 2}}, "trainable": true, "name": "flags_output"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "flags_output"}], "input_layers": [["main_input", 0, 0], ["src_spk_in", 0, 0], ["trg_spk_in", 0, 0], ["feedback_in", 0, 0]], "output_layers": [["params_output", 0, 0], ["flags_output", 0, 0]], "name": "model_1"}}